qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/stm32l0xx_hal_smbus.c
    if(__SMBUS_GET_ALERT_ENABLE(hsmbus) == RESET) 
    {
      /* Disable ERR interrupt */
      tmpisr |= SMBUS_IT_ERRI;
    }
  }

  /* Disable interrupts only at the end */
  /* to avoid a breaking situation like at "t" time */
  /* all disable interrupts request are not done */
  __HAL_SMBUS_DISABLE_IT(hsmbus, tmpisr);
  
  return HAL_OK;
}
/**
  * @brief  This function handles SMBUS Communication Timeout.
  * @param  hsmbus : Pointer to a SMBUS_HandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  Flag: specifies the SMBUS flag to check.
  * @param  Status: The new Flag status (SET or RESET).
  * @param  Timeout: Timeout duration
  * @retval HAL status
  */
static HAL_StatusTypeDef SMBUS_WaitOnFlagUntilTimeout(SMBUS_HandleTypeDef *hsmbus, uint32_t Flag, FlagStatus Status, uint32_t Timeout)  
{  
  uint32_t tickstart = 0x00;
  tickstart = HAL_GetTick();
  
  /* Wait until flag is set */
  if(Status == RESET)
  {    
    while(__HAL_SMBUS_GET_FLAG(hsmbus, Flag) == RESET)
    {
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if((Timeout == 0)||((HAL_GetTick() - tickstart ) > Timeout))
        {
          hsmbus->PreviousState = hsmbus->State;
          hsmbus->State= HAL_SMBUS_STATE_READY;
        
          /* Process Unlocked */
          __HAL_UNLOCK(hsmbus);
        
          return HAL_TIMEOUT;
        }
      }
    }
  }
  else
  {
    while(__HAL_SMBUS_GET_FLAG(hsmbus, Flag) != RESET)
    {
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if((Timeout == 0)||((HAL_GetTick() - tickstart ) > Timeout))
        {
          hsmbus->PreviousState = hsmbus->State;
          hsmbus->State= HAL_SMBUS_STATE_READY;
        
          /* Process Unlocked */
          __HAL_UNLOCK(hsmbus);
        
          return HAL_TIMEOUT;
        }
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Handles SMBUSx communication when starting transfer or during transfer (TC or TCR flag are set).
  * @param  hsmbus: SMBUS handle.
  * @param  DevAddress: specifies the slave address to be programmed.
  * @param  Size: specifies the number of bytes to be programmed.
  *   This parameter must be a value between 0 and 255.
  * @param  Mode: new state of the SMBUS START condition generation.
  *   This parameter can be one or a combination  of the following values:
  *     @arg SMBUS_NO_MODE: No specific mode enabled.
  *     @arg SMBUS_RELOAD_MODE: Enable Reload mode.
  *     @arg SMBUS_AUTOEND_MODE: Enable Automatic end mode.
  *     @arg SMBUS_SOFTEND_MODE: Enable Software end mode and Reload mode.
  * @param  Request: new state of the SMBUS START condition generation.
  *   This parameter can be one of the following values:
  *     @arg SMBUS_NO_STARTSTOP: Don't Generate stop and start condition.
  *     @arg SMBUS_GENERATE_STOP: Generate stop condition (Size should be set to 0).
  *     @arg SMBUS_GENERATE_START_READ: Generate Restart for read request.
  *     @arg SMBUS_GENERATE_START_WRITE: Generate Restart for write request.
  * @retval None
  */
static void SMBUS_TransferConfig(SMBUS_HandleTypeDef *hsmbus,  uint16_t DevAddress, uint8_t Size, uint32_t Mode, uint32_t Request)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_SMBUS_INSTANCE(hsmbus->Instance));
  assert_param(IS_SMBUS_TRANSFER_MODE(Mode));
  assert_param(IS_SMBUS_TRANSFER_REQUEST(Request));
    
  /* Get the CR2 register value */
  tmpreg = hsmbus->Instance->CR2;
  
  /* clear tmpreg specific bits */
  tmpreg &= (uint32_t)~((uint32_t)(I2C_CR2_SADD | I2C_CR2_NBYTES | I2C_CR2_RELOAD | I2C_CR2_AUTOEND | I2C_CR2_RD_WRN | I2C_CR2_START | I2C_CR2_STOP | I2C_CR2_PECBYTE));
  
  /* update tmpreg */
  tmpreg |= (uint32_t)(((uint32_t)DevAddress & I2C_CR2_SADD) | (((uint32_t)Size << 16 ) & I2C_CR2_NBYTES) | \
              (uint32_t)Mode | (uint32_t)Request);
    
  /* update CR2 register */
  hsmbus->Instance->CR2 = tmpreg;  
}  

/**
  * @}
  */

#endif /* HAL_SMBUS_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

